GENERATOR
  None
Model: "model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_6 (InputLayer)         (None, 256, 256, 1)       0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 128, 128, 64)      1088      
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 128, 128, 64)      0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 64, 64, 128)       131200    
_________________________________________________________________
batch_normalization_4 (Batch (None, 64, 64, 128)       512       
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 64, 64, 128)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 32, 32, 256)       524544    
_________________________________________________________________
batch_normalization_5 (Batch (None, 32, 32, 256)       1024      
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 16, 16, 512)       2097664   
_________________________________________________________________
batch_normalization_6 (Batch (None, 16, 16, 512)       2048      
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, 16, 16, 512)       0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 8, 8, 512)         4194816   
_________________________________________________________________
batch_normalization_7 (Batch (None, 8, 8, 512)         2048      
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 8, 8, 512)         0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 4, 4, 512)         4194816   
_________________________________________________________________
batch_normalization_8 (Batch (None, 4, 4, 512)         2048      
_________________________________________________________________
leaky_re_lu_10 (LeakyReLU)   (None, 4, 4, 512)         0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 2, 2, 512)         4194816   
_________________________________________________________________
batch_normalization_9 (Batch (None, 2, 2, 512)         2048      
_________________________________________________________________
leaky_re_lu_11 (LeakyReLU)   (None, 2, 2, 512)         0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 4, 4, 512)         4194816   
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 4, 4, 512)         4194816   
_________________________________________________________________
batch_normalization_10 (Batc (None, 4, 4, 512)         2048      
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 8, 8, 512)         4194816   
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 8, 8, 512)         4194816   
_________________________________________________________________
batch_normalization_11 (Batc (None, 8, 8, 512)         2048      
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 16, 16, 512)       4194816   
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 16, 16, 512)       4194816   
_________________________________________________________________
batch_normalization_12 (Batc (None, 16, 16, 512)       2048      
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 32, 32, 256)       2097408   
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 32, 32, 256)       1048832   
_________________________________________________________________
batch_normalization_13 (Batc (None, 32, 32, 256)       1024      
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 64, 64, 128)       524416    
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 64, 64, 128)       262272    
_________________________________________________________________
batch_normalization_14 (Batc (None, 64, 64, 128)       512       
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 128, 128, 64)      131136    
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 128, 128, 64)      65600     
_________________________________________________________________
batch_normalization_15 (Batc (None, 128, 128, 64)      256       
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 256, 256, 1)       1025      
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 256, 256, 1)       17        
=================================================================
Total params: 44,656,210
Trainable params: 44,647,378
Non-trainable params: 8,832